Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Star Chasing Boys (KO>EN).tmx
Source language: ko
Languages: en

source: 좀 더...{j}좀 더...{j}대단한!{j}
en: ...we need... we need something more impressive!{j}

source: 다들 괜찮은 거지?
en: is everyone all right?

source: 길냥이?
en: a stray cat?

source: 카메라 감독님, 아까 말한 대타 뛸 애들이요.
en: sir, about the group that’s going to be filling in today.

source: 당신들…
en: you are from...

source: 솔이 형 같은 마법을!!
en: I need magical powers, like soule!

source: 설마 우리한테도 저러는 건 아니지...?
en: he’s not going to kill us too, is he...?

source: 상처 제대로 누르고 있어.
en: keep applying pressure on your wound, taho.

source: 저희들은 순수하게 스타원을 보호하려는 겁니다.
en: we are genuinely trying to protect star one.

source: 더는 실수할 수 없어!
en: I can’t risk making another mistake!

source: 아비스!{j}이제 사람들은 많이 대피한 거 같으니까
en: avys! most people have evacuated.{j}

source: 그게 덫인 줄도 모르고.
en: ...not knowing what he’s signing up for.

source: 회사와도 이야기가 됐고…
en: we’ve talked to your agency.

source: 데뷔한지 3년이 지났는데 알아보는 사람 하나 없으니
en: we debuted over three years ago, yet not a single person recognizes us.

source: ..형들..
en: guys,

source: 놀라게 해서 미안...
en: I’m sorry I made you guys worry...

source: 알겠습니다.{j}타시죠.
en: understood. you may get in.{j}

source: 매직 아일랜드로 간다.
en: go to magic island.

source: 키득
en: snicker

source: 안돼.
en: no way.

source: 새로운..매니저라고?
en: our new... manager?

source: 이 고양이는 뭐야?{j}아는 고양이?
en: anyway, what’s with the cat? do you know it?{j}

source: 나도 마법이 발현됐으면 도움이 됐을 텐데..
en: I wish I had magical powers too. then I could’ve helped him out.

source: 이번에 새로 들어가는 프로요?
en: the new tv show, right.

source: 신청곡...이...
en: the song you requested... is...

source: ....어...?
en: no way...

source: DK형!{j}괜찮아요?!!
en: dk! are you okay?!{j}

source: 씨익
en: grin

source: 전 읽었는데요...{j}몇 페이지 안 되지만...
en: but I did. though it was just a few pages.{j}

source: 저 날개는 뭐야?
en: what’s with those wings?

source: 방패가!
en: the shield!

source: 뚝섬에 있는 거기?
en: ...the one in ttukseom?

source: 이 세계의 규칙, 너희들도 알잖아?
en: you know about the rules.

source: 설마 그렇게 걱정할 정도로 큰일이 생길까?
en: it seems unlikely that something really terrible will happen.

source: 일반
en: General

source: ..내가 화가 나는 건 일을 그르쳐서가 아니야
en: I’m not angry because you failed in your mission...

source: 쿵
en: thump

source: 뭐지?
en: what was that, really?

source: 파삭
en: crackle

source: 다들 괜찮은 거 맞지?
en: is everyone all right?

source: 그리고 다른 연예인들도 우리랑 비슷 할 거 아냐.
en: besides, other celebrities must be in similar situations.

source: 보안상 동행하실 수 없습니다.
en: you cannot ride with us for security reasons.

source: 콰
en: kaboom

source: 그럼 파도가 내려앉는 순간...
en: the moment the waves crash...

source: 으악~
en: ack!!

source: 매직 아일랜드라면....
en: by magic island, you mean...

source: 리허설 전에 인사드리고 와.
en: you should go say hi before the rehearsal.

source: ….이렇게 뵙게 돼서 반갑군요.
en: the pleasure is mine.

source: 마법을 빌려 쓸 수 있다고?
en: one can borrow magic?

source: 계속 애타게 기다렸습니다.
en: ...and we kept waiting...

source: 이 자식이..{j}감히
en: how dare you little...{j}

source: 으아악!!
en: gah!!

source: ..마법에 재능이 있는 사람에게 전폭적인 지원을 아끼지 않는다고 들었습니다.
en: I’ve heard that they provide generous support to those talented in magic.

source: 정말 저 녀석들이 운명의 소년들인가?!
en: are they really the boys of destiny?!

source: 띠링
en: ding

source: 타호야?!{j}어디가?!
en: taho! where are you going?!{j}

source: 그건…
en: well...

source: 이렇게...
en: is this...

source: 보고 자야지.
en: I’ll take another look before going to bed.

source: 이제 진짜 시간이 없어.
en: we’re really running out of time.

source: 우리 못 믿으면 무대에서 춤추기 힘들 거야.
en: ...it’ll be difficult for you to dance on stage if you don’t trust us.

source: 다, 다들
en: e-everybody...

source: 너희들의 운명 말이다.
en: your fate, that is.

source: 좀 어때?
en: how are you feeling?

source: 난 아들 혼자 보내지 않을 겁니다.
en: I’m not letting my son go without me.

source: 유진 형 내가 간다~
en: I’m coming, eugene!

source: 초인적인 능력을 구사하는 아이돌
en: ...that base on water, fire, or psychokinesis.

source: 촤학-
en: splash

source: 회사에 연락을 먼저 해야겠습니다.
en: I should contact the agency first.

source: 쩌정
en: clink

source: 다 왔어.
en: we’re here.

source: 지금 가!
en: coming.

source: 그렇군요.
en: is that so?

source: 원래 뚝섬 근처에 이런 곳이 있었던가?
en: I’ve never seen a place like this near ttukseom island.

source: 마법 유무에 따른 대중들의 선호도는 굉장히 뚜렷해서
en: the public’s preference for magic is so strong...

source: 으아아아아~
en: gahhh...

source: 어..어떡하죠?{j}빨리 병원에...
en: o-oh no... quick, let’s take him to the hospital--{j}

source: 제대로 치료 받으실 수 있는 곳으로 함께 가시죠.
en: come with us. we will take you to a place where you can get better treatment.

source: 안돼!!!!
en: no!!!

source: 맞아
en: oh, right

source: 이제 집에 간대
en: we’re going home.

source: 계세요?{j}실례합니다.
en: excuse me... hello?{j}

source: 병원에선 뭐래?
en: what did the vet say?

source: 거의 다 왔습니다
en: yes, almost there.

source: 포션은 마력을 보충해 주는 효과가 있습니다.
en: the potion supplements your magical powers.

source: 척
en: stomp

source: 짝짝
en: good job!

source: 상황이 위급하긴 했지.
en: we were definitely in dire straits.

source: 잘 할 수 있어...{j}잘 할 수 있어...
en: I can do this... I got this...{j}

source: 아, 그러고 보니…
en: oh, I remember...

source: 아무리 그래도 형 혼자서는 힘들어!
en: ...but he can’t do this alone!

source: 촤르르륵
en: swoosh

source: 하긴 차라도 얻어 탈 수 있음 집으로 돌아갈 수 있을 거 아냐
en: yeah. who knows, at least we might get a ride back home.

source: 의심의 싹은 모두 잘라버려야겠지.
en: ...we must eliminate them to be safe.

source: 위험해요!!
en: watch out!!

source: ...우리가..{j}뭘 어떻게 하면 되죠?
en: so... what do we have to do now?{j}

source: 형들이랑 달리 그냥 조용히 발현 된 거 같아.
en: ...I think my magic manifested more subtly than yours.

source: 오늘의 주인공들이 도착했네!!
en: here comes the stars of the day!

source: 파이팅!!
en: let’s do this!!

source: 오랜만의 무대라 쫄았어?
en: are you nervous for the upcoming performance?

source: 발음의 문제도 있지만....
en: diction is important, but...

source: 자신의 마법 속성을 파악하지 못한 것이다.
en: you weren’t aware of your magic’s characteristics.

source: 아악!
en: argh!

source: 왜 갑자기 마법서가 사라진 거지?
en: ...but where’d it go?

source: 팟-
en: flash

source: 이렇게 중요한 때 그런 불길한 걸 봤다고 말하기도 그렇고...
en: there’s no way I can tell them I saw something so creepy at a time like this.

source: 해를 끼친?
en: pull out what hurt him...?

source: 형이 우리를 믿어 줄 수 있는지가 중요해.
en: it’s important that you do.

source: 뭐해?{j}다 왔어.
en: what are you doing? we’re here.{j}

source: 너무 위험해.{j}디케이 형의 뭘 믿고 마법을 배우겠다는 거야?
en: it’s too risky. how could you even trust this guy?{j}

source: 치이이...
en: whirr

source: 혹시 모르니까 저 사람 엄호를 해줘야…
en: I should cover him just in case--

source: 비틀
en: wobble

source: 이래서 2군 폐급은 부르지 않는 건데
en: this is why we never invite tier two groups.

source: 내 친구 최진영을 찾아.
en: find my friend, jinyeong choi.

source: 여긴 자신의 운명을 절실히 알고 싶은 사람들 밖에 못 들어오는 곳이란다, 얘들아
en: only those who desperately wish to learn about their fates can come in here, little ones.

source: 궁금하네요.{j}그런 소문이 있는 곳에서…
en: I’m curious. why an organization...{j}

source: 왜 음악이 안나오지?
en: why isn’t the music coming on?

source: 너 요즘 잘나가는 거 같더라.
en: I can see you’re doing well these days.

source: 안 돼!!{j}저러다가는!!
en: no!! at this rate...!!{j}

source: 건강한 정신과 신체에서 훌륭한 마법이 완성된다!
en: a fine magic comes from good physical and mental health.

source: 솔이만..{j}네 괜찮습니다.
en: just soule? no problem.

source: 자 그럼~
en: all right!

source: 잘 부탁해~
en: good luck!

source: 나도 그렇게 생각해.{j}유진 형이 얼마나 연습했었는데
en: I agree. plus, eugene practiced so hard for it.{j}

source: 마법 아이돌.
en: magic idols.

source: 휘오오
en: whoosh

source: 슈왁
en: swoosh

source: 뭐?{j}우린 마법도 못쓰는데 왜・・・!?
en: what? but we can’t use magic!{j}

source: 애드립이라도 할까?
en: should I improvise something?

source: 나도 더 열심히 해야지...
en: on that note, I should work harder.

source: 대기실 알려줄까?
en: should I walk you to her green room?

source: 쫄긴 누가 쫄아.
en: of course not.

source: 후다닥~
en: dash

source: 근데 매니저 형..{j}뭔가 좀 이상하지 않아?
en: by the way, don’t you find dk a little strange?{j}

source: 계속 찾던 사람이 우리라는 듯…
en: ...seemed to be looking for us.

source: 읏…!!
en: ugh...!!

source: 콰지지직
en: crackle

source: 이렇게 갑자기 나타나서 소원을 이뤄주겠다?
en: and now you come out of nowhere, offering to grant my wish?

source: 대체 어떻게 한 거야?
en: how did you do that?

source: 아냐!{j}지금은 이런걸 생각할 때가 아니지!
en: no, that’s enough! now’s not the time to think about it!{j}

source: 설마 이런 데서 사람이 사는 건가?
en: no way, someone actually lives in a place like this?

source: 꿀꺽
en: gulp

source: 일렁
en: fade

source: 지금은 이런걸 생각할 때가 아니지!
en: now is not the time to think about it!

source: 많은 사람들이 열광했습니다.
en: ...and start a new chapter in history.

source: 나란 놈!!
en: seriously!

source: 아~대타래ㅋㅋX팔리게.
en: oh, they’re filling in. haha, what an embarrassment.

source: 저사람 왜 저래?!
en: what’s wrong with that guy?!

source: 제 2 화
en: Episode 2

source: 이거 식물들의 포자구나.{j}사람으로 치면 애기들이야
en: these must be the spores. they’re just babies.{j}

source: 마법 있는 아이돌은 1군, 없는 아이돌은 2군으로 분류된다.
en: ...that idols with magical powers fall under tier one, while ones without fall under tier two.

source: ...라곤 했지만
en: I said that to encourage them...

source: 지금 몇 시...{j}일어나야 돼에~?
en: what time is it...? do we have to get up now?{j}

source: 최초로 19세 이상에서
en: but for the first time, an impressive level of magic was unleashed...

source: 지금 안 잘 거야?
en: are you not going to bed, taho?

source: 될거 같아서 하긴했는데… 나 어떻게 한거지??
en: I tried because I thought it might work... but how did I do it?

source: 뭐 좋은 수 없을까...
en: what should we do...?

source: 좋아!
en: great.

source: 훽
en: turn

source: ...세상을 구할 힘...?
en: the power... to save the world...?

source: 좀 더...{j}좀 더...{j}대단한!
en: ...we need... we need something more impressive!{j}

source: ....미안.
en: sorry...

source: 쉬는 게 좋을 텐데...
en: I think he needs a break.

source: 지금까지 기운 낼 수 있게 해준 게 형이야.
en: ...you cheered us up, to this very day.

source: 야 인마!{j}간 떨어지는 줄 알았잖아!!
en: viken! you almost gave me a heart attack!!{j}

source: 큭!
en: ugh!

source: 뭐지??
en: what’s happening?

source: 이번엔 아비스~
en: avys, you’re next!

source: 울부짖지 않아도 발현될 만큼
en: you were desperate enough for a manifestation...

source: 컴백 무대 기대하겠습니다.
en: I look forward to your comeback performance.

source: 이게...{j}어떻게....
en: what...? how...?{j}

source: 진영이다.
en: it’s jinyeong.

source: ...여기 적힌 게 보인다고?
en: you can... read what’s here?

source: 그건 너희들의 운명이자
en: those names not only show your fates...

source: 싱긋
en: grin

source: 간식도 샀다?
en: plus snacks!

source: 어때?
en: what do you think?

source: 차, 차가 움직이잖아!!
en: t-the car is driving itself!

source: 정신수양
en: meditation

source: 우와
en: wow

source: 솔이 형이 너무 걱정이 많은 거야
en: you worry too much, soule.

source: 스타원이 누구?{j}저날 마법 첨 써본 거 맞음?
en: who’s star one? you sure they never used magic before?{j}

source: 그래도 그 기획사에서 널 키워주겠다 할까?
en: do you still think the agency would be willing to take you in?

source: 대기실
en: green room

source: 네놈들의 능력이 이렇게나 쓸모없는 수준이었나?!!
en: is this the best you can do?

source: 내 말이 안 들려?
en: do you not hear me?

source: 우..{j}우와… 내가 한 거 맞아?
en: w-whoa... did I really do that?{j}

source: 그러려고 했는데… 방금 무슨 얘기야? 솔직히 말해준다고? 뭘?
en: that was the plan, but... what was that about how you don't want to keep secrets from me?

source: 네 대표님.
en: hello?

source: 너무 과하다고 생각하지 않아?
en: don’t you think all this is a bit much?

source: 당장 그 아일 내 앞으로 데려와
en: bring him to me. now.

source: 천막은??
en: and the tent?

source: 그래도...
en: still...

source: 제1화
en: episode 1

source: 적당히 먼 곳으로 보낸 것뿐이야.
en: I sent him somewhere a bit far away.

source: 좀 더...
en: ... we need...

source: 타호야?!
en: taho!

source: 멋있지?!
en: cool, isn’t it?

source: 유진
en: eugene

source: ...기죽지말고 연습한 대로만 하자.
en: don’t be discouraged. let’s just do as we practiced.

source: 꺄아악~
en: aaah

source: ...뭐야..{j}뭐가 어떻게 된 거..
en: wh-what just happened...?{j}

source: 열심히 해보려고요.
en: ...but I want to give it my best.

source: 형!{j}달려!!
en: soule, run!!{j}

source: 그러니 여러분들이 하실 일은 이제 무대에 오르는 게 아닙니다.
en: therefore, your job is no longer to perform on stage.

source: 화아
en: fwoosh

source: 그쪽이 아냐!
en: it’s not that way!

source: 이 정도는 엄마로서 당연한 요구 아닌가요?
en: isn’t it a reasonable demand I can make as a mother?

source: 마법 쓰는 아이돌만 골라 공격한다고!
en: apparently, he only attacks idols that use magic!

source: 형도 발현된 거야?!
en: you manifested magic, too?!

source: 응원해 주는 친구도 있고...
en: he motivates me to work hard.

source: 그럼! 무대에 대한 열정은 유진형이 제일 크잖아? 걱정말고 얼른 다녀오자.
en: he will! eugene has the highest standards for performances of us all. so let's stop worrying about them and go to the vet.

source: 우리 아이들만이라도 안전한 곳으로 피하게 해야 할까?
en: should I at least get the boys to a safer place?

source: 정말 이날 만을 기다려왔는데
en: all of us have been waiting for this day...

source: #노래 #COVER
en: #live #COVER

source: 끝이 없군 왜 이렇게까지…
en: there’s so many of them. why are they taking it this far...?

source: 용의 일족'이죠?
en: ...the dragon sect.

source: 별 거 아니야.
en: nothing!

source: 앞으로 여러분들에게 엔터 회사나 매니저는 필요 없습니다.
en: you no longer need an entertainment agency or a manager.

source: 스르륵
en: brush

source: 탈
en: shake

source: 이것들이...
en: you brats...

source: ..뭐야 특별게스트라며?
en: wait, didn’t they say it was a special guest?

source: '스타원'
en: “star one.”

source: 네 발현이 늦은 이유는 간절함 이외의 것에 있지.
en: there’s another reason in your case.

source: 어떻게 저런 마법을 쓸 수 있지?
en: how does he use such magic?

source: 의심의 싹은 모두 잘라버려야겠지.{j}지금까지처럼
en: ...we must eliminate any possible threats, just as we’ve always done.{j}

source: 모두를 구원한다니?
en: for everyone else?

source: 부웅
en: whoosh

source: ...뭐야 스타원?
en: what’s star one doing here?

source: 아직 발현하지 않은 멤버들을 같은 수준으로 끌어올리는 것까지.
en: I’ll even make the other members who are yet to manifest magic to be on a par with you.

source: 몇 페이지 안 되지만...
en: just a few pages, though.

source: 솔직한 대화가 필요하시지 않습니까?
en: we need a candid conversation, don’t we?

source: 돈까스 브라더
en: Cutlet Brothers

source: 요약봇
en: Summary

source: 아까 봤어요.
en: I saw it earlier.

source: 얘도 먹을 거 챙겨줘야겠다.
en: I should get our furry friend something to eat, too.

source: 이쪽!!
en: over here!

source: 헉?!!!
en: what?!

source: 분명 차에 들이박기 일보 직전이었는데..
en: we were definitely about to crash into the truck.

source: 똑
en: plip

source: 운명의 소년들이 끝용의 앞에 설 자격을 갖추었을 때
en: when the boys of destiny deserve to stand before the dragon of the end...

source: 뭐지?{j}이게 무슨...
en: seriously, what was-?

source: 아하하하
en: hahaha

source: 아냐.
en: no.

source: 그래도 신경쓰이니까...{j}보고 자야지.
en: but that book keeps bothering me... I should take another look before going to bed.{j}

source: 좀 와보세요!!
en: can you come over here, please?

source: 난 좋은 마음으로 도우려고 한 거야.
en: I was only trying to help with good intentions.

source: 알아냈습니다.
en: ...and finally found out...

source: 오늘 너희들이 최고 하이라이트인 거 알지??{j}잘 부탁해~
en: you know you guys are the highlight of today’s program, right? good luck!{j}

source: 주춤
en: flinch

source: 뚝섬 근처인가?
en: I guess we’re near ttukseom island?

source: 굳이 사람을 마법으로 들어 올려야 돼?
en: do we really need to carry a person with magic?

source: 형!{j}정신 좀 차려봐!
en: wake up, soule!{j}

source: 나보다 먼저 데뷔 준비조에 들어갈 만큼 실력 좋은 녀석이었는데....
en: he was good enough to become a debut candidate before I did.

source: 잠깐 한 눈 판 사이에 놓쳐서 빈손으로 돌아가나 했는데
en: I thought I’d return empty-handed when I lost track of you for a second.

source: ...우리가..
en: so...

source: 배고파~~
en: I’m starving!

source: 그 누구라도 이길 수 있을
en: do you want power...

source: 그냥 꿈...
en: it was just...

source: 대박!
en: wow!

source: 당신들 혹시…
en: did you seriously think...

source: 와~ 무대 오르기도 전에 과로사 하겠다.
en: phew, I’ll pass out before the next performance at this rate.

source: 그래도 무대에 피해 안 끼치게 할게.{j}정말 큰 상처 아니야.{j}금방 나을 거야.
en: I promise this won’t affect our performance. this injury really is nothing. I’ll recover soon.{j}

source: 죄송합니다 차가막혀서..
en: sorry, we were stuck in traffic...

source: 형,
en: hyeong*! *hyeong is a term used by males to address older males.

source: 왜이래
en: get off me!

source: 핸드폰이라든지…
en: our phones, and such.

source: 하긴...본인들의 마법이 발현되기 전까지는 계속해서 불안할 거야.
en: they have a point. they’ll constantly be anxious until their magic is demonstrated.

source: 회
en: Views

source: 콰지직
en: crack

source: 슈우우
en: swoosh

source: 혹시 우리랑 무슨 관련 있는 걸까?
en: do we have something to do with the recent attacks?

source: 당신은 한두 번도 아니고 매번 비협조적이야.
en: you’re so uncooperative every single time.

source: 안락하게 모시겠습니다.{j}손님~ㅎㅎ
en: we’ll make your flight comfortable, sir!{j}

source: 이제 다 같이 연습하는 게 더 좋을 거 같아.
en: we should practice together from now on.

source: 이제 와서 우리가 형한테 그런 말 듣는다고 기분 상할 거 같아?
en: do you really think we’d get mad at you for saying one mean comment?

source: 난 이제 쉴게.
en: I should go get some rest.

source: 그 테러범들…
en: those terrorists...

source: 마법으로 강화한 검인데 이걸 버틴다고?!
en: he’s holding up against my magic-enforced sword?!

source: 앗 차가
en: agh, it’s cold!

source: 그로 인한 손실액 79억
en: as a result, the agency suffered a loss of 7.9 billion won*. *about 6.6 million USD.

source: 그러면 안돼.
en: I shouldn’t.

source: 필요할 때 제대로 하지도 못했지만...
en: though it didn’t work when I really needed it...

source: 그만둬!!
en: stop!!

source: 저..{j}디케이 형.
en: um... dk?{j}

source: 기쁨을 이해하시겠습니까?
en: ...when I witnessed it with my own eyes?!

source: 응?{j}아니 괜찮아.
en: huh? oh, no. I’m fine.{j}

source: 왜 그래?{j}무슨 일이야?
en: are you okay, taho? what’s wrong?{j}

source: 가...감독님 한 번만 다시 해보면 안될까요?
en: ummm... can we please have another chance?{j}

source: 표지 멋지네
en: nice cover

source: 크악!
en: argh!

source: 같은 목적으로 멸룡도가의 일원이 되었으나
en: although we have joined the dragon slayer clan for a common purpose...

source: 결국 이렇게 되었나…
en: so this is where we come to after all...

source: 첫 업로드 날짜가 어제...{j}이거 준비하느라 바빴구나.
en: his first upload was yesterday. he must’ve been busy working on this.{j}

source: 혹시 내가 애들을 위험하게 만든 게 아닐까?
en: ...but what if I’m also responsible for putting the members in danger?

source: 마법 발현의 핵심은
en: the key to unleashing magic is...

source: 어서 틀어!!
en: turn on the music!

source: 너무 위험해.
en: that’s too risky.

source: ...큰 무대라 긴장했나봐.{j}미안해.
en: sorry, performing on such a big stage must’ve got to me.{j}

source: 조금만 더 버티자!
en: let’s hang in there!

source: 부상이 심합니다.{j}먼저 치료를 받으시죠.
en: you have sustained a severe injury. please get treated first.{j}

source: 공중에서 찾는 게 빠를 거야
en: ...I should look from above.

source: 회사도 우리한테도 이번 무대 굉장히 중요해.
en: this performance is very important not just to the agency but also to us all.

source: 잘 됐네.
en: good.

source: 피해!!
en: run!

source: 우린 이제 발현 가능한 나이도 아닌데..
en: we’re way past the age to manifest magic...

source: 갑자기 왜 이러는 거야?!
en: what’s going on all of a sudden?!

source: 그렇게 노력해도 안 됐는데
en: but I couldn’t get any no matter how hard I tried.

source: 아...
en: oh...

source: 다들 뭐하고 있어?
en: are we all going to just stand back and watch?

source: 디케이 형.
en: dk?

source: 감사했습니다.
en: thank you.

source: 유빅 엔터 소속
en: signed under uvic entertainment.

source: 아야!
en: ouch!

source: 마법이 현재의 문명과 융화되어
en: many people welcomed the change...

source: 어렵지 않게 발휘할 수 있는 사람이 있었습니까?
en: ...have demonstrated such powerful magic with ease?

source: 어떻게 된 건지 모르겠지만
en: I have no idea how eugene is doing that...

source: 저~기 저거 매직 아일랜드 아니야?
en: isn’t that the magic island over there?

source: 마법을 사용해 누군가를 지키려는 순간
en: let’s suppose you’re trying to save someone.

source: 나가
en: get out.

source: 발현의 여부는 마법을 얼마나 절실하게 원하는가에 의해 결정된다.
en: whether you can manifest magic or not depends on how desperate you wish for it.

source: 어떠십니까?{j}이제 그동안 투자해 주신 게 아깝지 않으실 겁니다.
en: what do you think? I’m sure your investment will not go to waste.{j}

source: 많이 힘들었지?{j}다들 고생많았어~
en: 삭제

source: 그저 자격을 테스트해 본 거니까.
en: all I wanted to see was if you measured up.

source: 바닥이 미끄러웠잖아.
en: the floor was slippery.

source: 그쪽은 어때요?{j}들어 본 적 없어요?
en: what do you think? have you never heard of them before?{j}

source: 이번엔 형이 솔이 형 방패에 한 번 올라와 주라.
en: and hop on soule’s shield this time?

source: 죄송합니다.{j}보안상 동행하실 수 없습니다.
en: I am sorry but you cannot ride with us for security reasons.{j}

source: 치이익
en: whirr

source: 지금부터는 수많은 인력과 자본을 써 여러분들을 찾아낸 저희와 함께 하시면 됩니다.
en: you should work with us from now on. we have invested massive personnel and capital in finding you.

source: …엄마로서는
en: as a mother...

source: 음..
en: hm...

source: 문구를 생각해도 좋다.
en: ...or a phrase.

source: 뭐하냐?
en: what do you think you’re doing?

source: 미안해.
en: sorry.

source: 끝을 내주…
en: you’re a dead meat--

source: 아, 으응,
en: oh, okay.

source: 뭐하고 있어!{j}얼른 뒤로 피해!
en: don’t just sit there! get away from here!{j}

source: 피융
en: twang

source: 어떤 마법일지 궁금하다.
en: let’s see how they do.

source: 스타원이 누구?
en: who’s star one?

source: ..라곤 했지만
en: I said that to encourage them...

source: 꺄아아
en: kyaaa

source: 저기...{j}여기가 어딘가요?
en: um... could you tell us where we are?

source: 저녁에 연습실 가야 되니까 지금 뭐라도 먹자.
en: let’s eat before we head over to the practice studio later.

source: 스타원은 그만두세요.
en: quit star one.

source: 솔아,
en: soule,

source: 됐어.{j}바닥이 미끄러웠잖아.{j}넘어진데는 괜찮아?
en: don’t worry about it. the floor was slippery. are you hurt?{j}

source: 저러다가는!!
en: I need to stop this!

source: 마법의 기원?
en: the origin of all magic?

source: 니들 이런 무대에 올라가 본 적도 없잖아.
en: you’ve never performed on a stage like this before.

source: 아, 물론
en: oh, and of course...

source: 달칵-
en: flick

source: 자, 납득이 됐어?
en: now does it make sense to you?

source: 장소를 지원했으니 약속대로 그날 일반인의 피해가 생기지 않는 것에만 집중할 겁니다.
en: I provided the location, so my priority now is to minimize civilian casualties.

source: 이번 무대에서 중요한 건 솔이랑, 아비스, 비켄 이라니까!!
en: I said soule, avys, and viken are the stars this time!

source: ...차까지 반납이라니...
en: I can’t believe they even took away the car...

source: 곧 컴백무대라며?
en: I saw it on the news.

source: 솔, 유진, 타호, 비켄, 아비스 5인조 그룹
en: a five-member group consisting of soule, eugene, taho, viken, and avys.

source: 내 정체보다 질문의 답을 먼저 생각하는 게 좋을 거야
en: it’s probably for the better to answer my question before you ask about who I am.

source: 좀 더 기다려 보고…
en: let’s wait a few more--

source: 제가 모를 거라고 생각하신 건 아니겠죠?{j}당신들…
en: ...I wouldn’t recognize you? you’re from...{j}

source: 깜짝
en: shook

source: 괜..찮아, 형.{j}진정해.
en: I-I’m okay, avys. calm down.{j}

source: 어디가?!
en: where are you going?!

source: 어?{j}채널 오픈했잖아?
en: huh? he started his own channel!{j}

source: 시간에 맞춰서 준비 못 할까 봐 말 못 한 거잖아.
en: we haven’t told him because we were worried that we won’t be ready on time.

source: ..처리하려 했으나 변수가 생겨 실패했습니다.
en: I tried eliminating them, but the tables turned on me.

source: 많이 좋아 졌을까
en: ...since then?

source: 이녀석들..
en: these brats...

source: 난 스타원 매니저로서 같이 움직여야 해.
en: I must stay with star one as their manager.

source: 뭐...
en: what...

source: 다행이다.
en: I’m happy for him.

source: 지금 눈앞에 있는 여러분들입니다.
en: you are those wizards.

source: 그러니 증명해 봐
en: so prove yourself.

source: 간호사
en: Nurse

source: 콰아아아
en: boom

source: …어, 저기….
en: uh... well...

source: 타호 넌 괜찮아?{j}안 힘들어?
en: how about you, taho? aren’t you tired?{j}

source: 자신이 어떤 힘을 가지고 있는지도 몰랐다는 거다.
en: ...because you didn’t even know what kind of powers you had.

source: 치킨!!
en: that sounds good.

source: 간절함은 누구나 있다.{j}하지만 집중력에 따라
en: everyone has a desperate heart. but your level of concentration...{j}

source: 꾹-
en: clench

source: 왜이렇게 늦게와여 !!
en: You’re late!!

source: 박PD님~!!{j}좀 와보세요!!
en: hey, park! can you come over here, please?{j}

source: 강한 힘을 원해!
en: ...strong enough to save everyone!

source: 퐁~
en: plop

source: 어 그래?
en: I see.

source: 어후 깜짝이야!
en: that really scared me!

source: 꽤 상위 마법서인데
en: this is a pretty advanced spellbook.

source: 성심껏 노력했습니다만..{j}만족스러우셨나요?
en: are you enjoying your stay here? we have been trying our best to keep you comfortable.{j}

source: 꺅!!
en: aaahhh!

source: 그럼 그 파트에서 뭘 하라는 거예요?
en: what do you want us to do for that part, then?

source: 전부 빈 페이지?
en: the pages are empty.

source: 지익
en: pow

source: 아님 사고로 집을 나온 거던가.
en: or went missing after leaving home by accident.

source: 멍하니 있을 때가 아니야!
en: this is not the time to get lost in my thoughts!

source: 궁금하네요.
en: I’m curious.

source: 야 인마!
en: viken! you almost gave me a heart attack!!

source: 마주쳤다・・・!
en: he saw me...!

source: 뭐 하는 거야!!{j}비켜!!
en: what are you doing?! move, taho!{j}
